In [9]:
import pandas as pd 
import numpy as np

Load dataset nyc_weather_2018 and weather_stations, then calculate the average elevation of stations that calculat‘SNOW’ and contains ‘NJ US’ in its name.

In [ ]:
# merges với nhau 
weather_1 = pd.read_csv("/content/nyc_weather_2018.csv")
weather_2 = pd.read_csv("/content/weather_stations.csv")
A = weather_1[(weather_1.datatype == 'SNOW')].drop_duplicates('station')
print(A.shape)

(98, 5)

In [ ]:
weather_2.head()
weather_2 = weather_2.rename(columns={'id': 'station'})
weather_2.head(10)

             station                             name  ...  longitude  elevation
0  GHCND:US1CTFR0022          STAMFORD 2.6 SSW, CT US  ... -73.577000       36.6
1  GHCND:US1CTFR0039            STAMFORD 4.2 S, CT US  ... -73.568176        6.4
2  GHCND:US1NJBG0001        BERGENFIELD 0.3 SW, NJ US  ... -74.001983       20.1
3  GHCND:US1NJBG0002    SADDLE BROOK TWP 0.6 E, NJ US  ... -74.083358       16.8
4  GHCND:US1NJBG0003             TENAFLY 1.3 W, NJ US  ... -73.977500       21.6
5  GHCND:US1NJBG0005          WESTWOOD 0.8 ESE, NJ US  ... -74.015858       15.8
6  GHCND:US1NJBG0006              RAMSEY 0.6 E, NJ US  ... -74.134068      112.2
7  GHCND:US1NJBG0008  SADDLE BROOK TWP 0.3 NNE, NJ US  ... -74.093406       12.8
8  GHCND:US1NJBG0010      RIVER VALE TWP 1.5 S, NJ US  ... -74.012348        9.4
9  GHCND:US1NJBG0011    NORTH ARLINGTON 0.7 NE, NJ US  ... -74.119043        8.2

[10 rows x 5 columns]

In [ ]:
data = A.merge(weather_2, left_on='station',right_on ='station')
data.head

<bound method NDFrame.head of                    date datatype  ...  longitude elevation
0   2018-01-01T00:00:00     SNOW  ... -74.139790      17.7
1   2018-01-01T00:00:00     SNOW  ... -74.118264      28.0
2   2018-01-01T00:00:00     SNOW  ... -74.000247      21.3
3   2018-01-01T00:00:00     SNOW  ... -74.233383     149.4
4   2018-01-01T00:00:00     SNOW  ... -74.035372      23.2
..                  ...      ...  ...        ...       ...
93  2018-10-19T00:00:00     SNOW  ... -74.419420      36.3
94  2018-11-16T00:00:00     SNOW  ... -74.425520     119.8
95  2018-11-19T00:00:00     SNOW  ... -74.057205      14.0
96  2018-11-21T00:00:00     SNOW  ... -74.372120      27.4
97  2018-12-24T00:00:00     SNOW  ... -74.258300     161.2

[98 rows x 9 columns]>

In [ ]:
c = data.elevation[(data.name.str.contains('NJ US'))&(data.datatype == 'SNOW')].mean()
print(c)

58.34848484848487

Load the fb dataset, then:
1. Calculate the percentage change between that and and last day in volumn (pct_change method)
2. Sort the dataframe by percentage change then get five days that have the biggest change.

In [ ]:
# ex2:
fb = pd.read_csv("/content/fb_2018.csv")
fb.head()

         date    open    high       low   close    volume
0  2018-01-02  177.68  181.58  177.5500  181.42  18151903
1  2018-01-03  181.88  184.78  181.3300  184.67  16886563
2  2018-01-04  184.90  186.21  184.0996  184.33  13880896
3  2018-01-05  185.59  186.90  184.9300  186.85  13574535
4  2018-01-08  187.20  188.90  186.3300  188.28  17994726

In [ ]:
# hàm pandas.pct_change() : tính phần trăm thay đổi theo dòng sau chia dòng trước 
fb = fb.assign(pct_change = lambda x: x.volume.pct_change())
print(fb.head())

         date    open    high       low   close    volume  pct_change
0  2018-01-02  177.68  181.58  177.5500  181.42  18151903         NaN
1  2018-01-03  181.88  184.78  181.3300  184.67  16886563   -0.069708
2  2018-01-04  184.90  186.21  184.0996  184.33  13880896   -0.177992
3  2018-01-05  185.59  186.90  184.9300  186.85  13574535   -0.022071
4  2018-01-08  187.20  188.90  186.3300  188.28  17994726    0.325624

In [ ]:
fb.sort_values(by = "pct_change",ascending= False).head(5)

           date    open    high     low   close     volume  pct_change
8    2018-01-12  178.06  181.48  177.40  179.37   77551299    7.087876
52   2018-03-19  177.01  177.17  170.06  172.56   88140060    2.611789
142  2018-07-26  174.89  180.13  173.75  176.26  169803668    1.628841
182  2018-09-21  166.64  167.25  162.81  162.93   45994800    1.428956
57   2018-03-26  160.82  161.10  149.02  160.06  126116634    1.352496

In [ ]:
# pd.cut(fb.volume, bins = number, label = ['low','hight','mediam'])
# pd.qcut() -> cut theo %

Create bins for each full number of earthquake magnitude (for instance, the first bin is (0, 1], the second is (1, 2], and so on) with the ml magnitude type and count how many are in each bin

In [ ]:
dt2 = pd.read_csv("/content/earthquakes.csv")
dt2 = dt2[dt2.magType == 'ml']
dt2.head(2)

  alert  cdi  ...        updated                                                url
0   NaN  NaN  ...  1539475395144  https://earthquake.usgs.gov/earthquakes/eventp...
1   NaN  NaN  ...  1539475253925  https://earthquake.usgs.gov/earthquakes/eventp...

[2 rows x 26 columns]

In [ ]:
dt2 = dt2.assign(col = pd.cut(dt2.mag, [0,1,2,3,4,5], labels=['q1','q2','q3','q4','q5']))
print(dt2[['mag','col']].head(3))

    mag col
0  1.35  q2
1  1.29  q2
2  3.42  q4

In [ ]:
print(dt2.col.value_counts())

q2    3105
q1    2207
q3     862
q4     122
q5       2
Name: col, dtype: int64

Load the dataset weather_by_station then:
1. Calculate the mean value each station recorded snow per month.
2. Count the number of times each station recorded snow per month.

In [36]:
dt3 = pd.read_csv("/content/weather_by_station.csv")
dt3.columns

Index(['date', 'datatype', 'station', 'value', 'station_name'], dtype='object')

In [37]:
dt3 = dt3[dt3.datatype == 'SNOW']
print(dt3.head)

<bound method NDFrame.head of              date datatype  ... value                                 station_name
2      2018-01-01     SNOW  ...   0.0               NORTH ARLINGTON 0.7 WNW, NJ US
4      2018-01-01     SNOW  ...   0.0                     GLEN ROCK 0.7 SSE, NJ US
7      2018-01-01     SNOW  ...   0.0                PALISADES PARK 0.2 WNW, NJ US
10     2018-01-01     SNOW  ...   0.0                       OAKLAND 0.9 SSE, NJ US
14     2018-01-01     SNOW  ...   0.0                    RIVER EDGE 0.4 NNE, NJ US
...           ...      ...  ...   ...                                          ...
80175  2018-12-31     SNOW  ...   0.0                               SYOSSET, NY US
80179  2018-12-31     SNOW  ...   0.0                    LA GUARDIA AIRPORT, NY US
80191  2018-12-31     SNOW  ...   0.0  NEWARK LIBERTY INTERNATIONAL AIRPORT, NJ US
80220  2018-12-31     SNOW  ...   0.0                  NY CITY CENTRAL PARK, NY US
80245  2018-12-31     SNOW  ...   0.0             JFK INTERNATIONAL AIRPORT, NY US

[13395 rows x 5 columns]>

In [38]:
# result = dt3.groupby('station').mean('value')
dt3 = dt3.assign(month =pd.DatetimeIndex(dt3['date']).month)
result = dt3.groupby(['station','month']).mean('value')
print(result)

                              value
station           month
GHCND:US1CTFR0039 1       29.000000
                  2       45.000000
                  3       55.000000
                  4      185.000000
                  12       0.000000
...                             ...
GHCND:USW00094789 8        0.000000
                  9        0.000000
                  10       0.000000
                  11       4.066667
                  12       0.000000

[841 rows x 1 columns]

In [39]:
result2 = dt3.groupby(['station','month']).sum()
print(result2)

                         value
station           month
GHCND:US1CTFR0039 1       58.0
                  2      135.0
                  3      165.0
                  4      185.0
                  12       0.0
...                        ...
GHCND:USW00094789 8        0.0
                  9        0.0
                  10       0.0
                  11     122.0
                  12       0.0

[841 rows x 1 columns]